espressif/arduino-esp32/libraries/BLE/src/gatt/BLEGattAttributes.nimble.cpp
/*
 * Copyright 2017-2026 Espressif Systems (Shanghai) PTE LTD
 * Copyright 2020-2025 Ryan Powell <ryan@nable-embedded.io> and
 * esp-nimble-cpp, NimBLE-Arduino contributors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

/**
 * @file BLEGattAttributes.nimble.cpp
 * @brief NimBLE server-side GATT attributes: characteristic access/registration/notify/indicate and descriptor permissions (BLE_GATT_SERVER_SUPPORTED).
 *
 * Spec references:
 *  - BT Core Spec v5.x, Vol 3, Part G (GATT) — server-side characteristic procedures.
 *  - §3.3.1.1 — Characteristic Properties bit-field (Read, Write, Notify, Indicate…).
 *  - §3.3.3.3 — Client Characteristic Configuration Descriptor (CCCD, UUID 0x2902):
 *               Bit 0 = Notifications Enabled, Bit 1 = Indications Enabled.
 *  - §4.10    — Notifications: server sends ATT_HANDLE_VALUE_NTF; no client confirmation.
 *  - §4.11    — Indications: server sends ATT_HANDLE_VALUE_IND; client replies with
 *               ATT_HANDLE_VALUE_CONFIRM before the server may send another indication.
 *  - BT Core Spec v5.x, Vol 3, Part F (ATT) — attribute protocol for GATT server:
 *  - §3.4.1.1 — ATT error codes (e.g. BLE_ATT_ERR_INSUFFICIENT_RES = 0x11,
 *               BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN = 0x0D).
 *  - §3.2.9   — ATT_MTU: default 23 bytes; max 517 bytes after MTU exchange.
 */

#include "core/BLEGuards.h"
#if BLE_NIMBLE

#include "gatt/BLEGattAttributes.nimble.h"
#include "server/BLEServer.nimble.h"
#include "core/BLEImplHelpers.h"
#include "gatt/BLECharacteristicValidation.h"
#include "esp32-hal-log.h"

#if BLE_GATT_SERVER_SUPPORTED

// --------------------------------------------------------------------------
// GATT access callback for characteristics
// --------------------------------------------------------------------------

/**
 * @brief NimBLE GATT read/write access handler for a characteristic: invokes user read/write hooks and copies value to or from the mbuf.
 * @param conn_handle Connection handle, or @c BLE_HS_CONN_HANDLE_NONE when not connection-scoped.
 * @param attr_handle GATT attribute handle (unused; reserved for diagnostics).
 * @param ctxt Read/write context with opcode, mbuf, and other stack fields.
 * @param arg Pointer to @c BLECharacteristic::Impl.
 * @return 0 and ATT error codes (e.g. @c BLE_ATT_ERR_INSUFFICIENT_RES) for the stack to send to the peer.
 * @note For write operations, the application onWrite callback runs before this function returns; on NimBLE, that can delay the ATT write response.
 */
int BLECharacteristic::Impl::accessCallback(uint16_t conn_handle, uint16_t attr_handle, struct ble_gatt_access_ctxt *ctxt, void *arg) {
  auto *impl = static_cast<BLECharacteristic::Impl *>(arg);
  if (!impl) {
    return BLE_ATT_ERR_UNLIKELY;
  }
  (void)attr_handle;

  // Note on authorization: when the characteristic is registered with
  // BLEPermission::ReadAuthorized / WriteAuthorized, NimBLE forwards every
  // ATT read/write through BLE_GAP_EVENT_AUTHORIZE (handled in
  // NimBLEServer::gapEventHandler). The stack only invokes this access
  // callback if the application returned BLE_GAP_AUTHORIZE_ACCEPT, so by
  // the time we land here the request is already authorized.

  switch (ctxt->op) {
    case BLE_GATT_ACCESS_OP_READ_CHR:
    {
      log_d("Characteristic %s: read by conn=%u", impl->uuid.toString().c_str(), conn_handle);

      BLECharacteristic::ReadHandler readCb;
      {
        BLELockGuard lock(impl->mtx);
        readCb = impl->onReadCb;
      }
      if (conn_handle != BLE_HS_CONN_HANDLE_NONE && readCb) {
        struct ble_gap_conn_desc desc;
        if (ble_gap_conn_find(conn_handle, &desc) == 0) {
          BLECharacteristic chr = BLECharacteristicImplCommon::makeHandle(impl->shared_from_this());
          readCb(chr, BLEConnInfoImpl::fromDesc(desc));
        }
      }

      BLELockGuard lock(impl->mtx);
      int rc = os_mbuf_append(ctxt->om, impl->value.data(), impl->value.size());
      return (rc == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
    }

    case BLE_GATT_ACCESS_OP_WRITE_CHR:
    {
      uint16_t len = OS_MBUF_PKTLEN(ctxt->om);
      if (len > BLE_ATT_ATTR_MAX_LEN) {
        log_w("Characteristic %s: write len=%u exceeds max", impl->uuid.toString().c_str(), len);
        return BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN;
      }
      log_d("Characteristic %s: write by conn=%u len=%u", impl->uuid.toString().c_str(), conn_handle, len);
      uint8_t buf[BLE_ATT_ATTR_MAX_LEN];
      os_mbuf_copydata(ctxt->om, 0, len, buf);
      BLECharacteristic::WriteHandler writeCb;
      {
        BLELockGuard lock(impl->mtx);
        impl->value.assign(buf, buf + len);
        writeCb = impl->onWriteCb;
      }

      if (writeCb) {
        struct ble_gap_conn_desc desc;
        if (ble_gap_conn_find(conn_handle, &desc) == 0) {
          BLECharacteristic chr = BLECharacteristicImplCommon::makeHandle(impl->shared_from_this());
          writeCb(chr, BLEConnInfoImpl::fromDesc(desc));
        }
      }
      return 0;
    }

    default: return BLE_ATT_ERR_UNLIKELY;
  }
}

// --------------------------------------------------------------------------
// GATT access callback for descriptors
// --------------------------------------------------------------------------

/**
 * @brief NimBLE GATT read/write access handler for a descriptor, mirroring the characteristic path for user callbacks and stored value.
 * @param conn_handle Active connection, or the none handle for host-only access.
 * @param attr_handle Descriptor attribute handle.
 * @param ctxt Access context from NimBLE.
 * @param arg Pointer to @c BLEDescriptor::Impl.
 * @return 0 on success, or a NimBLE ATT error code.
 * @note For descriptor writes, onWrite runs before this returns; on NimBLE the ATT response may be delayed until the callback completes.
 */
int BLECharacteristic::Impl::descAccessCallback(uint16_t conn_handle, uint16_t attr_handle, struct ble_gatt_access_ctxt *ctxt, void *arg) {
  auto *desc = static_cast<BLEDescriptor::Impl *>(arg);
  if (!desc) {
    return BLE_ATT_ERR_UNLIKELY;
  }

  switch (ctxt->op) {
    case BLE_GATT_ACCESS_OP_READ_DSC:
    {
      BLEDescriptor::ReadHandler readCb;
      {
        BLELockGuard lock(desc->mtx);
        readCb = desc->onReadCb;
      }
      if (readCb && conn_handle != BLE_HS_CONN_HANDLE_NONE) {
        struct ble_gap_conn_desc conn_desc;
        if (ble_gap_conn_find(conn_handle, &conn_desc) == 0) {
          BLEDescriptor dsc = BLEDescriptorImplCommon::makeHandle(desc->shared_from_this());
          readCb(dsc, BLEConnInfoImpl::fromDesc(conn_desc));
        }
      }
      BLELockGuard lock(desc->mtx);
      int rc = os_mbuf_append(ctxt->om, desc->value.data(), desc->value.size());
      return (rc == 0) ? 0 : BLE_ATT_ERR_INSUFFICIENT_RES;
    }

    case BLE_GATT_ACCESS_OP_WRITE_DSC:
    {
      uint16_t len = OS_MBUF_PKTLEN(ctxt->om);
      uint8_t buf[BLE_ATT_ATTR_MAX_LEN];
      if (len > BLE_ATT_ATTR_MAX_LEN) {
        return BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN;
      }
      os_mbuf_copydata(ctxt->om, 0, len, buf);
      BLEDescriptor::WriteHandler writeCb;
      {
        BLELockGuard lock(desc->mtx);
        desc->value.assign(buf, buf + len);
        writeCb = desc->onWriteCb;
      }
      if (writeCb && conn_handle != BLE_HS_CONN_HANDLE_NONE) {
        struct ble_gap_conn_desc conn_desc;
        if (ble_gap_conn_find(conn_handle, &conn_desc) == 0) {
          BLEDescriptor dsc = BLEDescriptorImplCommon::makeHandle(desc->shared_from_this());
          writeCb(dsc, BLEConnInfoImpl::fromDesc(conn_desc));
        }
      }
      return 0;
    }

    default: return BLE_ATT_ERR_UNLIKELY;
  }
}

// --------------------------------------------------------------------------
// BLECharacteristic public API
// --------------------------------------------------------------------------

