espressif/arduino-esp32/libraries/BLE/src/gatt/BLEGattAttributes.nimble.cpp
// API contract is documented on the declarations in the public BLE*.h headers; the definitions below carry implementation notes only.

// CCCD bit 0 (0x0001) enables notifications. GATT §4.10: notifications have no ATT
// acknowledgment. Delivered via NimBLE ble_gatts_notify_custom; stack limits and MTU apply.
BTStatus BLECharacteristic::notify(const uint8_t *data, size_t length) {
  if (!_impl || _impl->handle == 0) {
    log_w("Characteristic: notify called but not registered (handle=0)");
    return BTStatus::InvalidState;
  }
  if (!(_impl->properties & BLEProperty::Notify)) {
    log_w("Characteristic %s: notify called but Notify property not set", _impl->uuid.toString().c_str());
    return BTStatus::InvalidState;
  }

  std::vector<std::pair<uint16_t, uint16_t>> subs;
  {
    SemaphoreHandle_t serverMtx = (_impl->service && _impl->service->server) ? _impl->service->server->mtx : nullptr;
    BLELockGuard lock(serverMtx);
    subs = _impl->subscribers;
  }
  for (auto &[connHandle, subVal] : subs) {
    if (subVal & BLE_CCCD_NOTIFY) {
      notify(connHandle, data, length);
    }
  }
  return BTStatus::OK;
}

// Uses NimBLE ble_gatts_notify_custom; large payloads are subject to MTU and host buffering.
BTStatus BLECharacteristic::notify(uint16_t connHandle, const uint8_t *data, size_t length) {
  if (!_impl || _impl->handle == 0) {
    log_w("Characteristic: notify(conn) called but not registered (handle=0)");
    return BTStatus::InvalidState;
  }
  if (!(_impl->properties & BLEProperty::Notify)) {
    log_w("Characteristic %s: notify(conn) called but Notify property not set", _impl->uuid.toString().c_str());
    return BTStatus::InvalidState;
  }

  log_d("Characteristic %s: notify conn=%u len=%u", _impl->uuid.toString().c_str(), connHandle, length);
  struct os_mbuf *om = nullptr;
  if (data && length > 0) {
    om = ble_hs_mbuf_from_flat(data, length);
  } else {
    BLELockGuard lock(_impl->mtx);
    om = ble_hs_mbuf_from_flat(_impl->value.data(), _impl->value.size());
  }
  if (!om) {
    log_e("Characteristic %s: notify - no memory for mbuf", _impl->uuid.toString().c_str());
    return BTStatus::NoMemory;
  }

  int rc = ble_gatts_notify_custom(connHandle, _impl->handle, om);
  if (rc != 0) {
    log_w("Characteristic %s: notify failed for conn=%u rc=%d", _impl->uuid.toString().c_str(), connHandle, rc);
  }
  return (rc == 0) ? BTStatus::OK : BTStatus::Fail;
}

// CCCD bit 1 (0x0002) enables indications. Uses NimBLE ble_gatts_indicate_custom;
// indications require client confirmation at the ATT level.
BTStatus BLECharacteristic::indicate(const uint8_t *data, size_t length) {
  if (!_impl || _impl->handle == 0) {
    log_w("Characteristic: indicate called but not registered (handle=0)");
    return BTStatus::InvalidState;
  }
  if (!(_impl->properties & BLEProperty::Indicate)) {
    log_w("Characteristic %s: indicate called but Indicate property not set", _impl->uuid.toString().c_str());
    return BTStatus::InvalidState;
  }

  std::vector<std::pair<uint16_t, uint16_t>> subs;
  {
    SemaphoreHandle_t serverMtx = (_impl->service && _impl->service->server) ? _impl->service->server->mtx : nullptr;
    BLELockGuard lock(serverMtx);
    subs = _impl->subscribers;
  }
  for (auto &[connHandle, subVal] : subs) {
    if (subVal & BLE_CCCD_INDICATE) {
      indicate(connHandle, data, length);
    }
  }
  return BTStatus::OK;
}

// Uses NimBLE ble_gatts_indicate_custom; the client must send ATT_HANDLE_VALUE_CONFIRM
// (GATT §4.11) before the server may send the next indication on the same connection.
BTStatus BLECharacteristic::indicate(uint16_t connHandle, const uint8_t *data, size_t length) {
  if (!_impl || _impl->handle == 0) {
    log_w("Characteristic: indicate(conn) called but not registered (handle=0)");
    return BTStatus::InvalidState;
  }
  if (!(_impl->properties & BLEProperty::Indicate)) {
    log_w("Characteristic %s: indicate(conn) called but Indicate property not set", _impl->uuid.toString().c_str());
    return BTStatus::InvalidState;
  }

  log_d("Characteristic %s: indicate conn=%u len=%u", _impl->uuid.toString().c_str(), connHandle, length);
  struct os_mbuf *om = nullptr;
  if (data && length > 0) {
    om = ble_hs_mbuf_from_flat(data, length);
  } else {
    BLELockGuard lock(_impl->mtx);
    om = ble_hs_mbuf_from_flat(_impl->value.data(), _impl->value.size());
  }
  if (!om) {
    log_e("Characteristic %s: indicate - no memory for mbuf", _impl->uuid.toString().c_str());
    return BTStatus::NoMemory;
  }

  int rc = ble_gatts_indicate_custom(connHandle, _impl->handle, om);
  if (rc != 0) {
    log_w("Characteristic %s: indicate failed for conn=%u rc=%d", _impl->uuid.toString().c_str(), connHandle, rc);
  }
  return (rc == 0) ? BTStatus::OK : BTStatus::Fail;
}

/**
 * @brief Maps @ref BLEPermission to NimBLE descriptor att access flags.
 * @param perms Declared descriptor permissions.
 * @return @c BLE_ATT_F_* bitfield for @c ble_gatt_dsc_def.
 * @note Fail-closed: no permission bits means no att flags, so a descriptor
 *       declared with @ref BLEPermission::None stays inaccessible instead of
 *       silently falling back to open read. The validator already rejects that
 *       spec, so the only way to reach here with @c None is direct @c Impl
 *       construction, where an inaccessible descriptor is the safer outcome.
 */
static uint8_t mapDescriptorAttFlags(BLEPermission perms) {
  uint8_t flags = 0;
  if (perms & BLEPermission::ReadOpen) {
    flags |= BLE_ATT_F_READ;
  }
  if (perms & BLEPermission::WriteOpen) {
    flags |= BLE_ATT_F_WRITE;
  }
  if (perms & BLEPermission::ReadEncrypted) {
    flags |= BLE_ATT_F_READ | BLE_ATT_F_READ_ENC;
  }
  if (perms & BLEPermission::ReadAuthenticated) {
    flags |= BLE_ATT_F_READ | BLE_ATT_F_READ_AUTHEN;
  }
  if (perms & BLEPermission::ReadAuthorized) {
    flags |= BLE_ATT_F_READ | BLE_ATT_F_READ_AUTHOR;
  }
  if (perms & BLEPermission::WriteEncrypted) {
    flags |= BLE_ATT_F_WRITE | BLE_ATT_F_WRITE_ENC;
  }
  if (perms & BLEPermission::WriteAuthenticated) {
    flags |= BLE_ATT_F_WRITE | BLE_ATT_F_WRITE_AUTHEN;
  }
  if (perms & BLEPermission::WriteAuthorized) {
    flags |= BLE_ATT_F_WRITE | BLE_ATT_F_WRITE_AUTHOR;
  }
  return flags;
}

BLEDescriptor BLECharacteristic::createDescriptor(const BLEUUID &uuid, BLEPermission perms, size_t maxLen) {
  BLE_CHECK_IMPL(BLEDescriptor());

  // Stage-1 validation before we spend memory allocating the descriptor;
  // a rejected spec gets logged and the caller receives an empty handle.
  if (!bleValidateDescProps(uuid, _impl->uuid, perms)) {
    return BLEDescriptor();
  }

  auto desc = std::make_shared<BLEDescriptor::Impl>();
  desc->uuid = uuid;
  desc->chr = _impl.get();
  desc->permissions = perms;
  nimbleUuidFromPublic(uuid, desc->nimbleUUID);

