espressif/arduino-esp32/libraries/BLE/src/gatt/BLEGattAttributes.nimble.cpp
  desc->attFlags = mapDescriptorAttFlags(perms);
  desc->value.reserve(maxLen);

  impl.descriptors.push_back(desc);

  return BLEDescriptor(desc);
}

// Writes the user description via descriptor UUID 0x2901, creating it on demand.
void BLECharacteristic::setDescription(const String &desc) {
  if (!_impl) {
    return;
  }
  auto existing = getDescriptor(BLEUUID(BLE_DSC_UUID16_USER_DESC));
  if (existing) {
    existing.setValue(desc);
  } else {
    auto d = createDescriptor(BLEUUID(BLE_DSC_UUID16_USER_DESC), BLEPermission::ReadOpen, desc.length() + 1);
    d.setValue(desc);
  }
}

// --------------------------------------------------------------------------
// NimBLE GATT table builder
// --------------------------------------------------------------------------

/**
 * @brief Maps @c BLEProperty and @c BLEPermission to NimBLE @c ble_gatt_chr_flags (fail-closed: read/write bits require matching permissions).
 * @param props Declared GATT property bits (read, write, notify, etc.).
 * @param perms Permission and security requirements for the characteristic.
 * @return Fused characteristic flags for @c ble_gatt_chr_def.
 * @note Notify, indicate, and broadcast are not gated on the read/write permission mask the same way as basic read and write.
 */
static ble_gatt_chr_flags mapPropertyFlags(BLEProperty props, BLEPermission perms) {
  ble_gatt_chr_flags f = 0;

  const bool anyReadPerm = (perms & BLEPermission::ReadOpen) || (perms & BLEPermission::ReadEncrypted) || (perms & BLEPermission::ReadAuthenticated)
                           || (perms & BLEPermission::ReadAuthorized);
  const bool anyWritePerm = (perms & BLEPermission::WriteOpen) || (perms & BLEPermission::WriteEncrypted) || (perms & BLEPermission::WriteAuthenticated)
                            || (perms & BLEPermission::WriteAuthorized);

  // Operation axis — gated on matching permission direction.
  if (props & BLEProperty::Broadcast) {
    f |= BLE_GATT_CHR_F_BROADCAST;
  }
  if ((props & BLEProperty::Read) && anyReadPerm) {
    f |= BLE_GATT_CHR_F_READ;
  }
  if ((props & BLEProperty::WriteNR) && anyWritePerm) {
    f |= BLE_GATT_CHR_F_WRITE_NO_RSP;
  }
  if ((props & BLEProperty::Write) && anyWritePerm) {
    f |= BLE_GATT_CHR_F_WRITE;
  }
  if (props & BLEProperty::Notify) {
    f |= BLE_GATT_CHR_F_NOTIFY;
  }
  if (props & BLEProperty::Indicate) {
    f |= BLE_GATT_CHR_F_INDICATE;
  }
  if ((props & BLEProperty::SignedWrite) && anyWritePerm) {
    f |= BLE_GATT_CHR_F_AUTH_SIGN_WRITE;
  }

  // Security axis — additive modifiers on the operation bits above.
  // The *_AUTHOR flags are forwarded so NimBLE's ATT layer dispatches a
  // BLE_GAP_EVENT_AUTHORIZE to the server's GAP handler on every ATT
  // read/write, which we in turn route into BLESecurity::onAuthorization.
  // This keeps authorization inside the standard NimBLE security pipeline
  // (same site that checks enc/authen), reports a semantically-correct
  // BLE_ATT_ERR_INSUFFICIENT_AUTHOR on deny, and avoids duplicating the
  // check inside the characteristic access callback.
  if (perms & BLEPermission::ReadEncrypted) {
    f |= BLE_GATT_CHR_F_READ_ENC;
  }
  if (perms & BLEPermission::ReadAuthenticated) {
    f |= BLE_GATT_CHR_F_READ_AUTHEN;
  }
  if (perms & BLEPermission::ReadAuthorized) {
    f |= BLE_GATT_CHR_F_READ_AUTHOR;
  }
  if (perms & BLEPermission::WriteEncrypted) {
    f |= BLE_GATT_CHR_F_WRITE_ENC;
  }
  if (perms & BLEPermission::WriteAuthenticated) {
    f |= BLE_GATT_CHR_F_WRITE_AUTHEN;
  }
  if (perms & BLEPermission::WriteAuthorized) {
    f |= BLE_GATT_CHR_F_WRITE_AUTHOR;
  }
  return f;
}

// Persistent storage for GATT table arrays (must outlive ble_gatts_start)
static std::vector<ble_gatt_svc_def> s_gattSvcs;
static std::vector<std::vector<ble_gatt_chr_def>> s_gattChrs;
static std::vector<std::vector<ble_gatt_dsc_def>> s_gattDscs;
static std::vector<std::vector<const ble_gatt_svc_def *>> s_gattIncludes;

int nimbleRegisterGattServices(const std::vector<std::shared_ptr<BLEService::Impl>> &services) {
  log_d("GATT: registering %u service(s)", (unsigned)services.size());
  s_gattSvcs.clear();
  s_gattChrs.clear();
  s_gattDscs.clear();
  s_gattIncludes.clear();

  for (auto &svc : services) {
    log_d("GATT: service %s with %u characteristic(s)", svc->uuid.toString().c_str(), (unsigned)svc->characteristics.size());
    nimbleUuidFromPublic(svc->uuid, svc->nimbleUUID);
    std::vector<ble_gatt_chr_def> chrs;

    for (auto &chr : svc->characteristics) {
      if (!bleValidateCharForRegistration(*chr, /*stackIsNimble=*/true)) {
        log_e("GATT: characteristic %s rejected by validation", chr->uuid.toString().c_str());
        return BLE_HS_EINVAL;
      }

      nimbleUuidFromPublic(chr->uuid, chr->nimbleUUID);
      std::vector<ble_gatt_dsc_def> dscs;
      for (auto &dscImpl : chr->descriptors) {
        nimbleUuidFromPublic(dscImpl->uuid, dscImpl->nimbleUUID);
        ble_gatt_dsc_def d = {};
        d.uuid = &dscImpl->nimbleUUID.u;
        d.att_flags = dscImpl->attFlags;
        d.access_cb = BLECharacteristic::Impl::descAccessCallback;
        d.arg = dscImpl.get();
        dscs.push_back(d);
      }
      dscs.push_back({});
      s_gattDscs.push_back(std::move(dscs));

      ble_gatt_chr_def c = {};
      c.uuid = &chr->nimbleUUID.u;
      c.access_cb = BLECharacteristic::Impl::accessCallback;
      c.arg = chr.get();
      c.flags = mapPropertyFlags(chr->properties, chr->permissions);
      c.val_handle = &chr->handle;
      c.descriptors = s_gattDscs.back().data();
      chrs.push_back(c);
    }
    chrs.push_back({});
    s_gattChrs.push_back(std::move(chrs));

    ble_gatt_svc_def s = {};
    s.type = BLE_GATT_SVC_TYPE_PRIMARY;
    s.uuid = &svc->nimbleUUID.u;
    s.characteristics = s_gattChrs.back().data();
    s_gattSvcs.push_back(s);
  }
  s_gattSvcs.push_back({});  // sentinel

  // Fixup Included Service pointers. Done after the vector is finalized so
  // element addresses are stable. NimBLE's includes field is a
  // null-terminated array of const ble_gatt_svc_def* pointing into
  // s_gattSvcs.
  for (size_t i = 0; i < services.size(); ++i) {
    auto &svc = services[i];
    if (svc->includedServices.empty()) {
      continue;
    }
    std::vector<const ble_gatt_svc_def *> incPtrs;
    for (auto &inc : svc->includedServices) {
      for (size_t j = 0; j < services.size(); ++j) {
        if (services[j] == inc) {
          incPtrs.push_back(&s_gattSvcs[j]);
          break;
        }
      }
    }
    incPtrs.push_back(nullptr);  // sentinel
    s_gattIncludes.push_back(std::move(incPtrs));
    s_gattSvcs[i].includes = s_gattIncludes.back().data();
  }

  int rc = ble_gatts_count_cfg(s_gattSvcs.data());
  if (rc != 0) {
    log_e("ble_gatts_count_cfg: rc=%d", rc);
    return rc;
  }

