espressif/arduino-esp32/libraries/BLE/src/gatt/BLEGattAttributes.nimble.cpp
  rc = ble_gatts_add_svcs(s_gattSvcs.data());
  if (rc != 0) {
    log_e("ble_gatts_add_svcs: rc=%d", rc);
  }
  return rc;
}

#else /* !BLE_GATT_SERVER_SUPPORTED -- stubs */

// Stubs for BLE_GATT_SERVER_SUPPORTED == 0: notify/indicate return NotSupported; no descriptors.

BTStatus BLECharacteristic::notify(const uint8_t *, size_t) {
  log_w("GATT server not supported");
  return BTStatus::NotSupported;
}

BTStatus BLECharacteristic::notify(uint16_t, const uint8_t *, size_t) {
  log_w("GATT server not supported");
  return BTStatus::NotSupported;
}

BTStatus BLECharacteristic::indicate(const uint8_t *, size_t) {
  log_w("GATT server not supported");
  return BTStatus::NotSupported;
}

BTStatus BLECharacteristic::indicate(uint16_t, const uint8_t *, size_t) {
  log_w("GATT server not supported");
  return BTStatus::NotSupported;
}

BLEDescriptor BLECharacteristic::createDescriptor(const BLEUUID &, BLEPermission, size_t) {
  log_w("GATT server not supported");
  return BLEDescriptor();
}

void BLECharacteristic::setDescription(const String &) {
  log_w("GATT server not supported");
}

#endif /* BLE_GATT_SERVER_SUPPORTED */

// ==========================================================================
// BLEDescriptor - NimBLE server-side descriptor permissions/attribute flags
// ==========================================================================

#if BLE_GATT_SERVER_SUPPORTED

// Maps BLEPermission flags to NimBLE att access flags before registration.
void BLEDescriptor::setPermissions(BLEPermission perms) {
  BLE_CHECK_IMPL();
  // Store both the native flags and the source BLEPermission so the
  // cross-backend validator (which runs again at registration time) can
  // reason about logical permissions after a post-creation mutation.
  impl.attFlags = mapDescriptorAttFlags(perms);
  impl.permissions = perms;
}

#else /* !BLE_GATT_SERVER_SUPPORTED -- stubs */

// Stubs for BLE_GATT_SERVER_SUPPORTED == 0: setPermissions is a no-op (log only).

void BLEDescriptor::setPermissions(BLEPermission) {
  log_w("GATT server not supported");
}

#endif /* BLE_GATT_SERVER_SUPPORTED */

#endif /* BLE_NIMBLE */
